/* # */
/* # ***** BEGIN LICENSE BLOCK ***** */
/* # Version: MPL 1.1/GPL 2.0/LGPL 2.1 */
/* # */
/* # The contents of this file are subject to the Mozilla Public License Version */
/* # 1.1 (the \"License\"); you may not use this file except in compliance with */
/* # the License. You may obtain a copy of the License at */
/* # http://www.mozilla.org/MPL/ */
/* # */
/* # Software distributed under the License is distributed on an \"AS IS\" basis, */
/* # WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License */
/* # for the specific language governing rights and limitations under the */
/* # License. */
/* # */
/* # The Original Code is mozilla.org code. */
/* # */
/* # The Initial Developer of the Original Code is */
/* # Netscape Communications Corporation. */
/* # Portions created by the Initial Developer are Copyright (C) 1998 */
/* # the Initial Developer. All Rights Reserved. */
/* # */
/* # Contributor(s): */
/* #   Sean Cotter <cotter@netscape.com> */
/* # */
/* # Alternatively, the contents of this file may be used under the terms of */
/* # either the GNU General Public License Version 2 or later (the \"GPL\"), or */
/* # the GNU Lesser General Public License Version 2.1 or later (the \"LGPL\"), */
/* # in which case the provisions of the GPL or the LGPL are applicable instead */
/* # of those above. If you wish to allow use of your version of this file only */
/* # under the terms of either the GPL or the LGPL, and not to allow others to */
/* # use your version of this file under the terms of the MPL, indicate your */
/* # decision by deleting the provisions above and replace them with the notice */
/* # and other provisions required by the GPL or the LGPL. If you do not delete */
/* # the provisions above, a recipient may use your version of this file under */
/* # the terms of any one of the MPL, the GPL or the LGPL. */
/* # */
/* # ***** END LICENSE BLOCK ***** */

"Title" = "Security Warning";
"MixedContentMessage" = "You have requested an encrypted page that contains some unencrypted information. Information that you see or enter on this page could easily be read by a third party.";
"LeaveSecureMessage" = "You are about to leave an encrypted page. Information you send or receive from now on could easily be read by a third party.";
"EnterSecureMessage" = "You have requested an encrypted page. The web site has identified itself correctly, and information you see or enter on this page can’t easily be read by a third party.";
"WeakSecureMessage" = "You have requested a page that uses low-grade encryption. The web site has identified itself correctly, but information you see or enter on this page could be read by a third party. ";
"PostToInsecureFromSecureMessage" = "Although this page is encrypted, the information you have entered is to be sent over an unencrypted connection and could easily be read by a third party.##Are you sure you want to continue sending this information?##";
"PostToInsecureFromInsecureMessage" = "The information you have entered is to be sent over an unencrypted connection and could easily be read by a third party.##Are you sure you want to continue sending this information?##";
"MixedContentShowAgain" = "Alert me whenever I’m about to view an encrypted page that contains some unencrypted information.";
"LeaveSecureShowAgain" = "Alert me whenever I leave an encrypted page for one that isn’t encrypted. ";
"EnterSecureShowAgain" = "Alert me whenever I am about to view an encrypted page.";
"WeakSecureShowAgain" = "Alert me whenever I am about to view a page that uses low-grade encryption.";
"PostToInsecureFromInsecureShowAgain" = "Alert me whenever I submit information that’s not encrypted.";
"SecurityButtonTooltipText" = "Displays security information about the current page";
"SecurityButtonMixedContentTooltipText" = "Warning: Contains unauthenticated content";
"Continue" = "Continue";
